app/views/home/index.html.erb

SELECT COUNT(*) FROM `product_likes` WHERE `product_likes`.`product_id` = 21
SELECT COUNT(*) FROM `products`
SELECT `product_likes`.* FROM `product_likes` WHERE `product_likes`.`product_id` IN (1, 2, 3, 4, 5, 6, 7, 8, 9, 11, 13, 16, 18, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35)
SELECT `products`.* FROM `products`
---
            <ul class="comments">
              <% likes = product.product_likes.size %>