app/controllers/home_controller.rb

  def index
    if biz_logged_in?
      if current_user.profile.nil?
        render :template => "users/profile"
        return
      elsif current_user.products.size <= 0
        render :template => "products/product_catalog"
      else
        @notifications = [["profile", current_user.profile.created_at], ["prices", current_user.products.last.created_at]]
        @notifications.sort!{|n1, n2| n2[1] <=> n1[1]}
        render :template => "home/notifications"
      end
    end
    @products = Product.includes([:product_images,:comments,:product_likes])
    @like_products  = fb_current_user ? fb_current_user.product_likes.map(&:product_id) : []
---
SELECT COUNT(*) FROM `products` WHERE `products`.`user_id` = 1
SELECT `products`.* FROM `products` WHERE `products`.`user_id` = 1 ORDER BY `products`.`id` DESC LIMIT 1
SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`user_id` = 1 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`product_id` IN (1, 2, 3, 4, 5, 6, 7, 8, 9, 11, 13, 16, 18, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35)
SELECT `product_images`.* FROM `product_images` WHERE `product_images`.`product_id` IN (1, 2, 3, 4, 5, 6, 7)
SELECT `product_likes`.* FROM `product_likes` WHERE `product_likes`.`product_id` IN (1, 2, 3, 4, 5, 6, 7, 8, 9, 11, 13, 16, 18, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35)
SELECT `product_likes`.* FROM `product_likes` WHERE `product_likes`.`user_id` = 2