app/controllers/products_controller.rb

   def product_catalog
    if request.post?
      @product = Product.new(params[:product])
      @product.user = current_user
      @product.price = params[:product][:price].gsub(/\D+/, "")
      if check_for_image_upload and @product.valid?
        @product.save
        1.upto(MAX_IMAGES).each do |i|
          if !params["image_#{i}"].blank? || !params["image_remote_url_#{i}"].blank?
            product_image = ProductImage.new
            product_image.image = params["image_#{i}"]
            product_image.image_remote_url = params["image_remote_url_#{i}"]
            product_image.product_id = @product.id
            product_image.save
---
INSERT INTO `products` (`created_at`, `description`, `name`, `price`, `updated_at`, `user_id`) VALUES ('2012-08-22 07:20:27', 'The Ion Piano Apprentice for iPad is the ultimate piano teaching tool. It works with the iPad, iPod® and iPhone®. Simply connect your iPad, iPod or iPhone, download the free Piano Apprentice app and start playing piano instantly. Piano Apprentice is a lightweight, highly portable 25-note keyboard with built-in stereo speakers that deliver authentic piano sound and keys that respond to your touch. * Touch-sensitive keys with 25-note lighted keyboard * Follow the lighted keys and learn how to play piano quickly * Free piano teaching app available via iTunes® * Lightweight, portable design * Powered by batteries (included) or optional AC adapter * Core MIDI compliant Pricing and availability: Please note that all prices are subject to change without prior notice. Prices advertised on this site are for online orders only. Prices on some items may differ from those advertised in RadioShack stores. All merchandise may not be available at all stores, and all stores may not participate in all sales promotions. We recommend you contact the store to confirm product availability and price.', 'on® Piano Apprentice for iPad®', 75.0, '2012-08-22 07:20:27', 1)
INSERT INTO `product_images` (`image_content_type`, `image_file_name`, `image_file_size`, `image_updated_at`, `product_id`) VALUES ('image/jpeg', 'edges_14.jpg', 89447, '2012-08-20 11:10:52', 7)

  def purchase
    purchse_type = params[:purchase_type].to_i
    product = Product.find_by_id(params[:product_id])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1

  def set_like
    @product = Product.find(params[:id])
    product_like = ProductLike.new(:product_id => @product.id)
    product_like.user = fb_current_user
    product_like.save
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 2 LIMIT 1
INSERT INTO `product_likes` (`created_at`, `product_id`, `updated_at`, `user_id`) VALUES ('2012-08-21 10:12:10', 2, '2012-08-21 10:12:10', 2)

  def comment
    @product = Product.find(params[:id])
    if request.post?
      comment = params[:comment]
      @comment = fb_current_user.comments.new(:comment => comment.strip)
      @comment.product_id = @product.id
      if @comment.valid?
        @comment.save
---
INSERT INTO `comments` (`comment`, `created_at`, `product_id`, `updated_at`, `user_id`) VALUES ('Testing comment', '2012-08-22 10:36:06', 2, '2012-08-22 10:36:06', 2)