app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE (email = 'brijesh@gmail.com' and password='brijedsh') LIMIT 1
INSERT INTO `users` (`created_at`, `email`, `fb_uid`, `name`, `password`, `remember_token`, `remember_token_expires_at`, `updated_at`) VALUES ('2012-08-22 07:14:23', 'dk@dealkat.com', NULL, NULL, 'princessthecat', NULL, NULL, '2012-08-22 07:14:23')
---
  def biz
    if logged_in?
      redirect_to root_path
      return
    end
    if params[:user]
      logout_keeping_session!
      @user = User.authenticate(params[:user][:email], params[:user][:password])
      if @user
        session[@user.email] = nil
        self.current_user = @user
        new_cookie_flag = (params[:remember_me] == "1")
        handle_remember_cookie! new_cookie_flag
        redirect_back_or_default('/')
        flash[:notice] = nil
      else
        @new_user = User.find_by_email(params[:user][:email])
        if @new_user
          @message = "User/Password does not match."
        else
          @user = User.new(params[:user])

          if @user.valid?
            @user.save

INSERT INTO `profiles` (`address1`, `address2`, `city`, `created_at`, `name`, `phone`, `state`, `updated_at`, `user_id`, `website`, `zip`) VALUES ('82 Pioneer Way', 'Suite 109', 'Mountain View,', '2012-08-20 09:41:29', 'Dealkat', '4153233506', 'CA', '2012-08-20 09:41:29', 1, 'http://www.dealkat.com', '9401')
---
   def profile
    @profile = current_user.profile if current_user.profile
    if request.post?
      @profile = Profile.new(params[:profile])
      if @profile.valid?
        current_user.profile.destroy if current_user.profile
        @profile.user = current_user
        @profile.save

SELECT `users`.* FROM `users` WHERE `users`.`fb_uid` = '715592824' LIMIT 1
INSERT INTO `users` (`created_at`, `email`, `fb_uid`, `name`, `password`, `remember_token`, `remember_token_expires_at`, `updated_at`) VALUES ('2012-08-21 09:40:30', 'brijesh_shah_1986@yahoo.com', '715592824', NULL, NULL, NULL, NULL, '2012-08-21 09:40:30')
UPDATE `users` SET `name` = 'Brijesh Shah', `updated_at` = '2012-08-21 09:41:01' WHERE `users`.`id` = 2
---
  def fb_login
    if biz_logged_in?
      flash[:error] = "You are already login with business user."
      redirect_to root_path
      return
    end

    omniauth = request.env["omniauth.auth"]

    user = User.find_by_fb_uid(omniauth['uid']) || User.new(:fb_uid => omniauth['uid'])
    # render :text => omniauth.inspect and return false
    user.name = omniauth["info"]['name']
    user.fb_login = true
    user.email = omniauth["info"]['email']
    unless user.save