app/views/products/set_like.js.erb

SELECT COUNT(*) FROM `product_likes` WHERE `product_likes`.`product_id` = 16
---
});
jQuery("#product_<%=@product.id%>_likes").html(<%=@product.product_likes.size%>)